build/Request/GuardrailsRequestData.xml

<soap:Envelope
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<soap:Body>
<ns:GuardrailVerification xmlns:ns="urn:PegaRULES:SOAP:DemoServices:DemoPOC">
<GuardrailsInput>
<!-- this element may appear multiple times --><ApplicationList>
<ApplicationName>DevopsPoc</ApplicationName>
<ApplicationVersion>01.01.01</ApplicationVersion>
</ApplicationList>
</GuardrailsInput>
</ns:GuardrailVerification>
</soap:Body>
</soap:Envelope>
